Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You can transform an already entered expression to another one by adding a postfix to it after a dot and pressing Tab.
zh_cn: 您可以将一个已经输入的表达式转换为另一个表达式，方法是在一个点之后添加一个后缀并按 Tab。

source: You can try out the features described in the tips while this dialog stays open on the screen.
zh_cn: 当对话框在屏幕上保持打开状态时，您也可以尝试提示中描述的功能。

source: You can use &shortcut:InsertLiveTemplate; to complete any valid Live Template abbreviation if you don't remember it.
zh_cn: 如果您不记得它，可以使用 &shortcut:InsertLiveTemplate; 来完成任何有效的代码模板缩写。

source: You can use Basic Completion (&shortcut:CodeCompletion;) in HTML, CSS and JavaScript files, for completing attributes, parameters, tags, selectors, etc.
zh_cn: 你可以在 HTML， CSS 和 JavaScript 文件中使用 Basic Completion(基本补全) (&shortcut:CodeCompletion;) 来补全属性，参数，标签，选择器等。

source: You can use Basic Completion (&shortcut:CodeCompletion;) within Java String literals and in other file types, for completing .properties keys.
zh_cn: 你可以在 Java 字符串及其他文件类型中，使用Basic Completion(基本补全) (&shortcut:CodeCompletion;) 来补全 .properties 。

source: You can use the Extract Variable refactoring even on incomplete statements.
zh_cn: 即使在不完整的语句上，也可以使用Extract Variable（提取变量）重构。

source: You can use the gutters along the code to switch between Action methods and Views.
zh_cn: 您可以沿着代码使用 gutters 在 Action 方法和 Views 之间切换。

source: You can use the new version until your subscription expires on {0}.
zh_cn: 您可以使用新版本，直到您的订阅在 {0} 过期为止。

source: You can use this remote interpreter for your project, or just leave it as one of the available interpreters.
zh_cn: 您可以将此远程解释器用于您的项目，也可以将其作为可用的解释器之一。

source: You can view all methods of the implemented interfaces in a class, if you place the caret at the implements keyword in the class declaration, press &shortcut:HighlightUsagesInFile;, and select the desired interface from the list:
zh_cn: 你可以查看类中所实现的接口的所有方法，将插入符号放到类申明的 implements 关键字上，按 &shortcut:HighlightUsagesInFile;，然后从列表中选择所需的接口。

source: You can view all statements within the method where certain exceptions can be caught.
zh_cn: 您可以查看方法中可以捕获某些异常的所有语句。

source: You can work in the Python or Django shell without leaving the IDE.
zh_cn: 你不需要离开 IDE 就可以运行 Python 或 Django 脚本。

source: You do not have read permissions to {0}
zh_cn: 你没有 {0} 的读取权限

source: You do not need to open a file in the editor to change its line separator style.
zh_cn: 您不需要在编辑器中打开一个文件来更改其换行符样式。

source: You don't need to guess which __init__.py or views.py you are looking at...
zh_cn: 你不需要猜测你在看哪一个 __init__.py 或 views.py ...

source: You don't need to guess which index.html file you are looking at...
zh_cn: 你不需要猜测你在看哪一个 index.html ...

source: You don't need to invoke quick documentation explicitly (&shortcut:QuickJavaDoc;) - if you just move your mouse pointer over the desired symbol, the quick documentation pop-up window will show automatically.
zh_cn: 你不需要明确地调用快捷文档 (&shortcut:QuickJavaDoc;) ，只需将鼠标指针移到期望符号上，快捷文档将会自动弹窗显示。

source: You don't need to leave &productName; to work with your favorite shell.
zh_cn: 你不需要离开 &productName; 去使用你喜欢的 shell 。

source: You have a perpetual fallback license for the new version.
zh_cn: 您有新版本的永久备用许可证。

source: You have background tasks running.
zh_cn: 您有后台任务正在运行。

source: You have checked out {0} project file: {1} Would you like to open it?
zh_cn: 您已经检出了 {0} 项目文件 {1} 你想打开它吗？

source: You have checked out {0} project: {1} Would you like to open it?
zh_cn: 您已经检出了 {0} 项目: {1} 你想打开它吗？

source: You have entered malformed replacement string: ''{0}''
zh_cn: 您输入了格式错误的替换字符串：''{0}''

source: You have excluded some files from the active changelist when committing.
zh_cn: 在提交时，您已经从活动更改列表中排除了一些文件。

source: You have not specified any filtering criteria.
zh_cn: 您尚未指定任何筛选条件。

source: You have selected current {0} installation home.
zh_cn: 您选择了当前 {0} 的安装。

source: You have selected the intention category <b>{0}</b>.<br>By clicking the checkbox, you can enable/disable all intentions in this category.<br>To enable/disable a particular intention, select the intention inside this category.
zh_cn: 您选择了意向类别 <b>{0}</b>.<br>通过点击复选框，您可以启用/禁用此类别的所有意向。要启用/禁用一个特定意向，在该类别里面选择。

source: You have selected the postfix completion language.<br>By clicking the checkbox, you can enable/disable all postfix templates for the language.<br>To enable/disable a postfix template select it inside the group.
zh_cn: 你选择了后缀补全语言。<br>通过点击复选框，您可以启用/禁用该类别的所有后缀补全模板。<br>要启用/禁用一个后缀模板，在该组里选择。

source: You have to restart {0} to reload the settings.
zh_cn: 你必须重新启动 {0} 以重新加载设置。

source: You may always invoke it explicitly by using &shortcut:CodeCompletion;.
zh_cn: 你总可以通过 &shortcut:CodeCompletion; 明确调用它。

source: You may delete {0, choice, 1#this directory|2#these directories} to save disk space.
zh_cn: 你可以删除这{0, choice, 1#个|2#些}目录来节省磁盘空间。

source: You may easily move classes between packages with automatic correction of all places where they are used at.
zh_cn: 您可以轻松地在包之间移动类，并自动更正使用它们的所有地方。

source: You may easily override methods of the base class by pressing &shortcut:OverrideMethods; (Code | Override Methods).
zh_cn: 你可以通过按 &shortcut:OverrideMethods; (Code | Override Methods)轻松地覆写基类的方法。

source: You may need to manually configure the HiDPI mode to prevent UI scaling issues.
zh_cn: 您可能需要手动配置 HiDPI 模式以防止 UI 缩放的问题。

source: You may not be able to open the project with earlier versions of {1}.
zh_cn: 您可能无法使用早期版本的 {1} 打开项目。

source: You may now exit {0} and start it from the system menu<br/> (restart a session if a new entry seem not to appear).
zh_cn: 你现在可以退出 {0},从系统菜单中启动它<br/> (如果新条目似乎不显示，则重新启动会话)。

source: You may try out the features described in the tips while this dialog stays open on the screen.
zh_cn: 当对话框在屏幕上保持打开状态时，您也可以尝试提示中描述的功能。

source: You might also need to modify template project settings.
zh_cn: 您可能还需要修改模板项目设置。

source: You might not be able to fully undo this operation!
zh_cn: 您可能无法完全撤消此操作！

source: You must have the correct indent size and other settings set in the correspondence to your code style preferences in the "Source Code" options.
zh_cn: 您必须在与 "Source Code" 选项中的代码样式首选项中设置正确的缩进大小和其他设置。

source: You must have the path to your browser set in the File | Settings | Web Browsers options and paths to documentation files added to your project (File | Project Structure...) to use this feature.
zh_cn: 要使用该功能，你必须在 File | Settings | Web Browsers 选项中配置浏览器路径，并在 (File | Project Structure...) 中将文档文件添加到项目中。

source: You want your bookmarks and breakpoints to be always at hand, so that you can easily navigate through them?
zh_cn: 你希望你的书签和断点近在眼前，可以很方便地浏览它们吗？

source: You will never lose any code with this feature!
zh_cn: 使用此功能，你将不会失去任何代码！

source: You will not be able to open it by earlier versions.
zh_cn: 您将无法通过早期版本打开它。

source: You will not be able to open the project by earlier versions of IDEA.
zh_cn: 您将无法通过早期版本的 IDEA 打开该项目。

source: You will not be able to undo this operation!<br/>{1}</html>
zh_cn: 您将无法撤消此操作！<br/>{1}</html>

source: You'll see all the matching methods.
zh_cn: 您将看到所有匹配的方法。

source: Your changes were written to {1}.
zh_cn: 您的更改已写入 {1}。

source: Your changes were written to {2}.
zh_cn: 您的更改已写入 {2}。

source: Your evaluation license has expired.
zh_cn: 您的评估许可证已过期。

source: Your license has expired
zh_cn: 您的许可证已过期

source: Your license has expired.
zh_cn: 您的许可证已过期。

source: Your license is not valid for use with this version of {0}.
zh_cn: 您的许可证不适用于此版本的 {0}。

source: Your session will be limited to 30 minutes.
zh_cn: 您的会话将限制在30分钟。

source: Your session will be limited to 30 minutes.<br>{1}
zh_cn: 您的会话将限制为30分钟。<br>{1}

source: Your settings have been successfully exported.
zh_cn: 您的设置已成功导出。

source: Your version
zh_cn: 你的版本

source: Your {0} evaluation has expired.
zh_cn: 您的 {0} 评估已过期。

source: Your {0} license expires in {1}.
zh_cn: 您的 {0} 许可证将在 {1} 到期。

source: Your {0} license has expired.
zh_cn: 您的 {0} 许可证已过期。

source: ZOMBIE
zh_cn: 僵尸

source: Zoom
zh_cn: 放大

source: Zoom In
zh_cn: 放大

source: Zoom Out
zh_cn: 缩小

source: Zoom current window
zh_cn: 放大当前窗口

source: Zoom in
zh_cn: 放大

source: Zoom out
zh_cn: 缩小

source: [Duplicate]
zh_cn: [重复]

source: [Invalid]
zh_cn: [无效]

source: [partial]
zh_cn: [部分]

source: [unnamed group]
zh_cn: [未命名组]

source: ] expected
zh_cn: ] 是预期的

source: _About
zh_cn: 关于 | 关于汉化(_A)

source: _Add to migration roots
zh_cn: 添加到迁移根(_A)

source: _Aspect
zh_cn: Aspect(_A)

source: _Auto-Indent Lines
zh_cn: 自动缩进行(_A)

source: _Back
zh_cn: 后退(_B)

source: _Basic
zh_cn: 基本(_B)

source: _Build
zh_cn: 构建(_B)

source: _Check for Updates...
zh_cn: 检查更新...(_C)

source: _Class...
zh_cn: 类...(_C)

source: _Clear And Close
zh_cn: 清除并关闭(_C)

source: _Clear List
zh_cn: 清除列表(_C)

source: _Close
zh_cn: 关闭(_C)

source: _Close Active Editor
zh_cn: 关闭活动编辑器(_C)

source: _Code
zh_cn: 代码(_C)

source: _Code Cleanup...
zh_cn: 代码清理...(_C)

source: _Collapse
zh_cn: 折叠(_C)

source: _Compare with...
zh_cn: 与...比较...(_C)

source: _Completion
zh_cn: 补全(_C)

source: _Constant...
zh_cn: 常量...(_C)

source: _Context Info
zh_cn: 上下文信息(_C)

source: _Copy
zh_cn: 复制(_C)

source: _Declaration
zh_cn: 声明(_D)

source: _Delegate Methods...
zh_cn: 委托方法...(_D)

source: _Delegate...
zh_cn: 委托...(_D)

source: _Delete
zh_cn: 删除(_D)

source: _Delete...
zh_cn: 删除...(_D)

source: _Demos and Screencasts
zh_cn: 演示和截屏(_D)

source: _Edit
zh_cn: 编辑(_E)

source: _Edit Macros
zh_cn: 编辑宏(_E)

source: _Enable Version Control Integration...
zh_cn: 启用版本控制集成...(_E)

source: _Encapsulate Fields...
zh_cn: 封装字段...(_E)

source: _Expand All
zh_cn: 全部展开(_E)

source: _Export Settings...
zh_cn: 导出设置...(_E)

source: _Expression Type
zh_cn: 表达式类型(_E)

source: _Field...
zh_cn: 字段...(_F)

source: _File
zh_cn: 文件(_F)

source: _File...
zh_cn: 文件...(_F)

source: _Find
zh_cn: 查找(_F)

source: _Find Action...
zh_cn: 查找操作...(_F)

source: _Find...
zh_cn: 查找...(_F)

source: _Generate
zh_cn: 生成(_G)

source: _Generate Ant Build...
zh_cn: 生成 Ant 构建...(_G)

source: _Generate Coverage Report
zh_cn: 生成覆盖率报告(_G)

source: _Getting Started
zh_cn: 入门(_G)

source: _Goto Next Splitter
zh_cn: 转到下一个分割(_G)

source: _Help
zh_cn: 帮助(_H)

source: _Highlight Usages in File
zh_cn: 在文件中高亮显示使用(_H)

source: _Implement Methods...
zh_cn: 实现方法...(_I)

source: _Include File...
zh_cn: 包含文件...(_I)

source: _Inspect Code...
zh_cn: 检查代码...(_I)

source: _Interface...
zh_cn: 接口...(_I)

source: _Jump to Last Tool Window
zh_cn: 转到上一个工具窗口(_J)

source: _Jump to Navigation Bar
zh_cn: 跳转到导航栏(_J)

source: _Jump to Source
zh_cn: 跳转到源码(_J)

source: _Keymap Reference
zh_cn: 快捷键参考(_K)

source: _Line/Column...
zh_cn: 行/列...(_L)

source: _Macros
zh_cn: 宏(_M)

source: _Method Hierarchy
zh_cn: 方法层次结构(_M)

source: _Method...
zh_cn: 方法...(_M)

source: _Migrate...
zh_cn: 迁移...(_M)

source: _Module...
zh_cn: 模块...(_M)

source: _Move To Opposite Group
zh_cn: 移动到相对的组(_M)

source: _Move module
zh_cn: 移动模块(_M)

source: _Move...
zh_cn: 移动...(_M)

source: _Navigate
zh_cn: 导航(_N)

source: _New
zh_cn: 新建(_N)

source: _New...
zh_cn: 新建...(_N)

source: _Next Highlighted Error
zh_cn: 下一个高亮错误(_N)

source: _No
zh_cn: 否(_N)

source: _Open In Opposite Group
zh_cn: 在相对的组打开(_O)

source: _Open...
zh_cn: 打开...(_O)

source: _Override Methods...
zh_cn: 重写方法...(_O)

source: _Parameter Info
zh_cn: 参数信息(_P)

source: _Parameter...
zh_cn: 参数...(_P)

source: _Paste
zh_cn: 粘贴(_P)

source: _Pause Program
zh_cn: 暂停程序(_P)

source: _Pinned Mode
zh_cn: 固定模式(_P)

source: _Previous Highlighted Error
zh_cn: 上一个高亮错误(_P)

source: _Print...
zh_cn: 打印...(_P)

source: _Productivity Guide
zh_cn: 生产力指南(_P)

source: _Project...
zh_cn: 项目...(_P)

source: _Quick Evaluate Expression
zh_cn: 快速计算表达式(_Q)

source: _Quick Switch Scheme...
zh_cn: 快速切换方案...(_Q)

source: _Rebuild Project
zh_cn: 重建项目(_R)

source: _Redo {0}
zh_cn: 重做 {0}(_R)

source: _Refactor
zh_cn: 重构(_R)

source: _Reformat Code
zh_cn: 重新格式化代码(_R)

source: _Related Symbol...
zh_cn: 相关文件...(_R)

source: _Rename...
zh_cn: 重命名...(_R)

source: _Reopen Project
zh_cn: 重新打开(_R)

source: _Replace...
zh_cn: 替换...(_R)

source: _Revert
zh_cn: 还原(_R)

source: _Save All
zh_cn: 保存全部(_S)

source: _Search with Google
zh_cn: 用 Google 搜索(_S)

source: _Send to Favorites
zh_cn: 发送到收藏夹(_S)

source: _Show Bookmarks
zh_cn: 显示书签(_S)

source: _Show Usages
zh_cn: 显示使用(_S)

source: _SmartType
zh_cn: 智能类型(_S)

source: _Status Bar
zh_cn: 状态栏(_S)

source: _Support Center
zh_cn: 支持中心(_S)

source: _Surround With...
zh_cn: 包围...(_S)

source: _Symbol...
zh_cn: 符号...(_S)

source: _Tip of the Day
zh_cn: 每日提示(_T)

source: _Tool Buttons
zh_cn: 工具按钮(_T)

source: _Tool Windows
zh_cn: 工具窗口(_T)

source: _Toolbar
zh_cn: 工具栏(_T)

source: _Tools
zh_cn: 工具(_T)

source: _Type Declaration
zh_cn: 类型声明(_T)

source: _Undo {0}
zh_cn: 撤销 {0}(_U)

source: _Update
zh_cn: 更新(_U)

source: _Update Project
zh_cn: 更新项目(_U)

source: _Update {0}
zh_cn: 更新 {0}(_U)

source: _Validate
zh_cn: 校验(_V)

source: _Variable...
zh_cn: 变量...(_V)

source: _View
zh_cn: 视图(_V)

source: _View PSI Structure...
zh_cn: 查看 PSI 结构...(_V)

source: _Window
zh_cn: 窗口(_W)

source: _Windowed Mode
zh_cn: 窗口模式(_W)

source: _Yes
zh_cn: 是(_Y)

source: abstract\&nbsp;class
zh_cn: 抽象类

source: actions and views
zh_cn: actions 和 views

source: adaptive welcome
zh_cn: 自适应的欢迎

source: all
zh_cn: 所有

source: all expressions of some type
zh_cn: 某些类型的所有表达式

source: all fields of the class
zh_cn: 类的所有字段

source: all inner classes (within hierarchy)
zh_cn: 所有内部类(层次结构)

source: all methods of the class (within hierarchy)
zh_cn: 类的所有方法(层次结构)

source: alt insert in editor
zh_cn: 编辑器中的代码生成

source: ampersand
zh_cn: 符号

source: and
zh_cn: 和

source: and press &shortcut:EditorLineEnd; anywhere on the empty line between braces, the caret is positioned to one indent to the right from the position just under "public".
zh_cn: 然后在括号中的任何位置按下 &shortcut:EditorLineEnd; ，插入符将定位到 "public" 下方一个缩进位置的右侧。

source: and press &shortcut:CodeCompletion;.
zh_cn: 然后按下 &shortcut:CodeCompletion; 。

source: and press &shortcut:Inline; (Refactor | Inline... ).
zh_cn: 然后按 &shortcut:Inline; (Refactor | Inline... )。

source: and press &shortcut:IntroduceVariable; (Refactor | Extract Variable).
zh_cn: 然后按 &shortcut:IntroduceVariable; (Refactor | Extract Variable)。

source: and press &shortcut:IntroduceVariable; (Refactor | Extract | Variable...).
zh_cn: 然后按 &shortcut:IntroduceVariable; (Refactor | Extract | Variable...)。

source: and press &shortcut:SmartTypeCompletion; to see what happens.
zh_cn: 然后按下 &shortcut:SmartTypeCompletion; 看会发生什么。

source: and press &shortcut:SmartTypeCompletion;:
zh_cn: 然后按下 &shortcut:SmartTypeCompletion;：

source: and then press the Tab key to see what happens.
zh_cn: 然后按 Tab 键看会发生什么。

source: annotated classes
zh_cn: 注解类

source: annotated fields
zh_cn: 注解字段

source: annotated methods
zh_cn: 注解方法

source: annotation declarations
zh_cn: 注解声明

source: annotation type
zh_cn: 注解类型

source: annotations
zh_cn: 注解

source: annotations and diffs
zh_cn: 注释和差异

source: anonymous
zh_cn: 匿名

source: anonymous ({0})
zh_cn: 匿名 ({0})

source: anonymous class
zh_cn: 匿名类

source: anonymous classes
zh_cn: 匿名类

source: ant.jar not found in directory ''{0}''
zh_cn: ant.jar 未找到目录 ''{0}''

source: antivirus
zh_cn: 防病毒

source: any class initialization block
zh_cn: 任何类初始化块

source: anywhere
zh_cn: 在任何地方

source: apply patch
zh_cn: 应用补丁

source: array access
zh_cn: 数组访问

source: array elements
zh_cn: 数组元素

source: assignment
zh_cn: 赋值

source: assignments
zh_cn: 赋值

source: at line
zh_cn: 行

source: at {0}({1}:{2,number,#})
zh_cn: 在 {0}({1}:{2,number,#})

source: attempting to use incompatible return type
zh_cn: 尝试使用不兼容的返回类型

source: attribute
zh_cn: 属性

source: attribute value
zh_cn: 属性值

source: auto indent lines
zh_cn: 自动缩进行

source: autoindent closing brace
zh_cn: 闭合括号时自动缩进

source: autoindent pasted block
zh_cn: 粘贴块时自动缩进

source: blocks {0}
zh_cn: 块 {0}

source: boolean method result
zh_cn: 布尔方法的结果

source: boxed expressions
zh_cn: 装箱的表达式

source: boxing in declarations
zh_cn: 在声明中装箱

source: boxing in method calls
zh_cn: 在方法调用中装箱

source: branches
zh_cn: 分支

source: breadth-first order
zh_cn: 宽度排序优先

source: breakpoint speedmenu
zh_cn: 断点快速菜单

source: browse remote host
zh_cn: 浏览远程主机

source: build all
zh_cn: 构建所有

source: build all modules
zh_cn: 构建所有模块

source: built in server
zh_cn: 内置服务器

source: button to create a new {0} based on default settings
zh_cn: 按钮来基于默认设置创建一个新的 {0}

source: byte, char, short or int
zh_cn: byte, char, short 或 int

source: camel humps in code completion
zh_cn: 代码补全中的驼峰模式

source: camel prefixes in navigation popups
zh_cn: 导航弹窗中驼峰前缀

source: cancel by control arrows
zh_cn: 通过方向箭头取消

source: casts
zh_cn: 转换

source: change keymap
zh_cn: 更改快捷键

source: change signature after moving parameters
zh_cn: 移动参数后更改签名

source: change sorting
zh_cn: 更改排序

source: changes view
zh_cn: changes 视图

source: char, byte, short, int, Character, Byte, Short, Integer, String, or an enum
zh_cn: char, byte, short, int, Character, Byte, Short, Integer, String, 或 enum

source: check reg exp
zh_cn: 检查正则表达式

source: choose color...
zh_cn: 选择颜色...

source: class
zh_cn: 类

source: class implementing two interfaces
zh_cn: 实现两个接口的类

source: class name completion
zh_cn: 类名补全

source: class {0}
zh_cn: 类 {0}

source: class-based
zh_cn: 基于类的

source: classes
zh_cn: 类

source: classes with parameterless constructors
zh_cn: 具有无参数构造函数的类

source: classes, interfaces \& enums
zh_cn: 类，接口和枚举

source: cleanup all
zh_cn: 清理所有

source: cleanup module
zh_cn: 清理模块

source: clipboard stack
zh_cn: 剪贴板栈

source: close others
zh_cn: 关闭其他

source: closing tabs with middle mouse
zh_cn: 用鼠标中间关闭选项卡

source: closing tag
zh_cn: 闭合标签

source: code completion
zh_cn: 代码补全

source: code completion in search
zh_cn: 搜索中的代码补全

source: code completion middle
zh_cn: 中间代码补全

source: code completion no shift
zh_cn: 不区分大小写补全

source: color editing in android
zh_cn: android 中的颜色编辑

source: color editing in css
zh_cn: css 中的颜色编辑

source: color files
zh_cn: 颜色标记文件

source: column selection
zh_cn: 列选择

source: columns
zh_cn: 列

source: comment
zh_cn: 注释

source: comment code
zh_cn: 注释代码

source: comment line
zh_cn: 注释行

source: comments
zh_cn: 注释

source: comments, javadoc and metadata
zh_cn: 注释，javadoc 和元数据

source: commit ctrl K
zh_cn: 提交更改

source: compare
zh_cn: 比较

source: compile {0,choice, 1#module|2#modules} {1}; test classes
zh_cn: 编译 {0,choice, 1#模块|2#模块} {1}; 测试类

source: complete method
zh_cn: 补全方法

source: complete statement
zh_cn: 补全语句

source: complete with tab
zh_cn: 使用 tab 完成

source: completion import static
zh_cn: 补全时导入 static

source: completion in HTML
zh_cn: HTML 中的补全

source: conditional breakpoint
zh_cn: 条件断点

source: configuration
zh_cn: 配置

source: configuring terminal
zh_cn: 配置终端

source: consoles
zh_cn: 控制台

source: consoles code completion
zh_cn: 控制台代码补全

source: consoles history
zh_cn: 控制台历史记录

source: constructor
zh_cn: 构造函数

source: constructor docs
zh_cn: 构造函数文档

source: constructor {0}
zh_cn: 构造函数 {0}

source: constructors of the class
zh_cn: 类的构造函数

source: context info
zh_cn: 上下文信息

source: copy class
zh_cn: 复制类

source: copy paste reference
zh_cn: 复制粘贴引用

source: copy with no selection
zh_cn: 未选择时复制

source: coverage tool window
zh_cn: 覆盖工具窗口

source: create property tag
zh_cn: 创建属性标签

source: create target tag
zh_cn: 创建目标标签

source: create test intention action
zh_cn: 创建测试意图动作

source: create unresolved function or field
zh_cn: 创建未解决的方法或字段

source: ctrl D
zh_cn: 重复行或块

source: ctrl W
zh_cn: 扩展选择

source: ctrl dot in lookups
zh_cn: 在查阅列表中按 Ctrl + 点

source: ctrl pg up in commander
zh_cn: 控制面板中 Ctrl 上翻页

source: ctrl shift F4
zh_cn: Ctrl Shift F4 关闭打开的工具窗口选项卡

source: ctrl shift I
zh_cn: 快速定义

source: ctrl shift I for lookup
zh_cn: 查阅列表中查看定义

source: cucumber angle brackets
zh_cn: cucumber 尖括号

source: cucumber code completion
zh_cn: cucumber 代码补全

source: cucumber create examples
zh_cn: cucumber 创建示例

source: cucumber create examples comments
zh_cn: cucumber 创建示例注释

source: current class
zh_cn: 当前类

source: cycle
zh_cn: 循环

source: daemon
zh_cn: 守护

source: debugger watches
zh_cn: 调试器观察点

source: declaration
zh_cn: 声明

source: delete line
zh_cn: 删除行

source: deprecated list
zh_cn: 不推荐列表

source: deprecated methods
zh_cn: 已弃用的方法

source: depth-first order
zh_cn: 深度排序优先

source: description
zh_cn: 描述

source: diamond operators
zh_cn: diamond 操作

source: diff chevron
zh_cn: 差异 chevron

source: dir diff
zh_cn: 目录差异

source: direct subclasses
zh_cn: 直接子类

source: directory
zh_cn: 目录

source: directory was moved
zh_cn: 目录被移动

source: disable autopopup
zh_cn: 禁用自动弹窗

source: disable bulb
zh_cn: 禁用小灯泡

source: does not exist.
zh_cn: 不存在。

source: done.
zh_cn: 完成。

source: dot etc in lookups
zh_cn: 查阅列表中使用点号等符号

source: drag to open
zh_cn: 拖动打开

source: duplicate line
zh_cn: 重复行

source: duplicate module name
zh_cn: 重复模块名称

source: eclipse quick open
zh_cn: eclipse 快速打开

source: edit reg exp
zh_cn: 编辑正则表达式

source: element no longer exists
zh_cn: 元素不再存在

source: en&d index:
zh_cn: 结束索引：(&D)

source: enter directory in goto file
zh_cn: 转到文件时输入目录

source: entity
zh_cn: 实体

source: entity ejb
zh_cn: 实体 ejb

source: enum
zh_cn: 枚举

source: enum {0}
zh_cn: 枚举 {0}

source: enums
zh_cn: 枚举

source: equals() and hashCode()
zh_cn: equals() 和 hashCode()

source: equals() and hashCode() not paired
zh_cn: equals() 和 hashCode() 未匹配

source: equals() for nested arrays is not supported
zh_cn: equals() 不支持嵌套的数组

source: errors
zh_cn: 错误

source: escape
zh_cn: Esc

source: escape characters in resource bundle
zh_cn: 资源包中的转义字符

source: evaluate expression
zh_cn: 评估表达

source: evaluate expression in editor
zh_cn: 编辑器中计算表达式

source: except comments
zh_cn: 除了注释

source: except comments and string literals
zh_cn: 除了注释和字符串

source: except string literals
zh_cn: 除了字符串

source: exception
zh_cn: 异常

source: exclude from project
zh_cn: 从项目排除

source: excluded
zh_cn: 已排除

source: expected type{2}{0} like: {1}
zh_cn: 期望类型 {2}{0} 如: {1}

source: export usage tree
zh_cn: 导出使用树

source: expression
zh_cn: 表达式

source: expression expected
zh_cn: 表达式是预期的

source: expression result
zh_cn: 表达式结果

source: expressions
zh_cn: 表达式

source: extends {0}
zh_cn: 扩展 {0}

source: external java doc
zh_cn: 外部 java 文档

source: extract constant
zh_cn: 提取常量

source: extract field
zh_cn: 提取字段

source: extract method
zh_cn: 提取方法

source: extract parameter
zh_cn: 提取参数

source: extract variable
zh_cn: 提取变量

source: favorites tool window 1
zh_cn: 收藏夹工具窗口 1

source: favorites tool window 2
zh_cn: 收藏夹工具窗口 2

source: field
zh_cn: 字段

source: field selections
zh_cn: 字段选择

source: field {0}
zh_cn: 字段 {0}

source: fields of the class
zh_cn: 类的字段

source: fields/variables read
zh_cn: 字段/变量读取

source: fields/variables with given name pattern updated
zh_cn: 已更新给定名称模式的字段/变量

source: file
zh_cn: 文件

source: file already exists with same name
zh_cn: 同名文件已存在

source: file structure popup
zh_cn: 文件结构弹窗

source: file watchers inspection
zh_cn: 文件观察器检查

source: file {0} is too big or there are too many changes
zh_cn: 文件 {0} 过大或有太多的变化

source: filters
zh_cn: 过滤器

source: find action
zh_cn: 查找操作

source: find in path
zh_cn: 在路径中查找

source: find keymap
zh_cn: 查找快捷键

source: find replace toggle
zh_cn: 查找替换切换

source: find usages
zh_cn: 查找使用

source: finish by exclamation
zh_cn: 通过感叹号完成

source: finish by smart enter
zh_cn: 通过智能输入完成

source: fix doc comment
zh_cn: 修复文档注释

source: foreach loops
zh_cn: foreach 循环

source: foreach not applicable to type ''{0}''
zh_cn: foreach 不适用于 ''{0}'' 类型

source: generate anonymous body
zh_cn: 生成匿名体

source: generate new
zh_cn: 生成 new

source: generic casts
zh_cn: 泛型

source: generic classes
zh_cn: 泛型类

source: generic methods
zh_cn: 泛型方法

source: generics
zh_cn: 泛型

source: global elements/local types
zh_cn: 全局元素/局部类型

source: go to action
zh_cn: 转到操作

source: go to class
zh_cn: 转到类

source: go to declaration
zh_cn: 转到声明

source: go to file
zh_cn: 转到文件

source: go to folder
zh_cn: 转到文件夹

source: go to implementation
zh_cn: 转到实现

source: go to inspection
zh_cn: 转到检查

source: go to interface
zh_cn: 转到接口

source: go to symbol
zh_cn: 转到符号
